Revit 2027 API
Application.NewTypeBinding Method
Creates a new type binding object.
Overload List
Name | Description
NewTypeBinding() | Creates a new empty type binding object.
NewTypeBinding(CategorySet) | Creates a new type binding object containing the categories passed as a parameter.
Top
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace